{
    "report_title": "Market Report – 24th & 25th June 2025",
    "sale_week_number": "24",
    "year": "2025",
    "source_url": "https://sway.cloud.microsoft/TYMCLO2Mhrkyrilm?ref=Link",
    "report_page_url": "https://ceylonteabrokers.com/market-report-24th-25th-june-2025/",
    "retrieval_date": "2025-09-19T08:42:52.878668+00:00",
    "raw_text": "Accessibility View\nShare\n\nTMR.24\n\nThis week's Tea News\n\nRooted in resilience: Why Regenerative Agriculture is the future of Sri Lankan tea\n\nMay tea output rises 2.9% YoY\n\nTea Statistics\n\napp.powerbi.com\napp.powerbi.com\n\nMarket movement at International Auction Centers this week\n\nCurrency – As of 25th June 2025\n\nElevation Average (June 03rd Sale)\n\nHigh Grown\n\nRs.1,006.02     USD 3.35\n\n\nMedium Grown\n\nRs.990.15         USD 3.30\n\n\nLow Grown\n\nRs.1,205.39     USD 4.01\n\n\nTotal\n\nRs.1,119.48     USD 3.73\n\nQuantity Sold during the period 16th  - 21st June 2025\n\nTea Tech Tips\n\nWithering is a very important first step in tea manufacture. A good\nprocess will take place only if the correct degree is obtained very evenly\nin all the leaves. Not just a percentage of withered leaf to green leaf.\n\nCrop & Weather (For the period 17th - 24th June 2025)\n\nThe Western and Nuwara Eliya planting districts experienced showers\nthroughout the week. The Department of Meteorology forecasts rains to\nbe expected in both regions.\n\nThe Uva/Udapussellawa's experienced bright conditions. Heavy\nshowers are to be expected in both districts.\n\nThe Low growns reported sunny mornings followed by evening showers.\nFairly strong winds are to be expected in the Low grown districts.\n\nNuwara Eliya and Uva/Udapussellawa's maintained their crop intakes\nwhilst the Western and Low growns reported a decline.\n\nWeather Forecast (For the period 26th June - 02nd July 2025)\n\nThis Week's Market Movement at Colombo Tea Auction\n\nOrder of Sale this week\n\nDemand: Ex-Estate a few selected better teas were dearer, whilst others were irregular.\nLower demand prevailed for Low Growns.\n\nHigh Grown Teas\n\nBOP - Best and below best Western's  - A few selected invoices were\nfirm to dearer by Rs.20-40/- per kg, whilst others were irregular and\nbarely steady. Teas at the lower end maintained. Nuwara Eliya's were\nmostly unsold. Uda Pussellawa's were firm to dearer by Rs.10-20/- per\nkg. Uva's clean leaf teas held firm whilst others were irregular and\neasier.\n\nBOPF - Best and below best Western's  - A few selected invoices\nappreciated by Rs.50/- per kg, whilst others were irregular. At the lower\nend, coloury teas moved up by Rs.50/- per kg, whilst others were barely\nsteady. Nuwara Eliya's were mostly unsold. Uda Pussellawa's were firm.\nUva's clean leaf teas were firm to dearer by Rs. 20-40 per kg, whilst\nothers were irregular and barely steady.\n\nMedium Grown Teas\n\nBOP1 - Select best held firm whilst all others were lower by Rs. 50/-\nper kg.\n\nOP1 - In general, lower by Rs. 50/- per kg.\n\nPEK -  Select best and best held firm whilst all others were easier by\nRs.50/- per kg.\n\nPEK1 - Select best and best appreciated by Rs. 50/- per kg whilst all\nothers were lower by Rs. 100/- per kg.\n\nOP/OPA - Overall, lower by Rs. 20/- per kg\n\nFBOP - Select best and best lost by Rs. 50/- per kg. Below best\ndropped by Rs. 100/- per kg whilst others were lower by Rs. 50/- per\nkg.\n\nFBOPF1 - Select best and best declined by Rs. 50/- per kg. Below best\nlost by Rs. 80/- per kg. Others eased by Rs. 50/- per kg.\n\nCTC Teas\n\nHIGH GROWN\nBP1s - Hardly any offerings.\nPF1s - Clean leaf teas were barely steady, whilst others were irregular.\n\nMEDIUM GROWN\nBP1s - Mostly unsold.\nPF1s - Better teas held firm, whilst others were irregular.\n\nLOW GROWN\nBP1s - Irregular.\nPF1s - Better teas were firm to lower by Rs.20/- per kg, whilst others\nwere irregular.\n\nLow Grown Teas\n\nBOP1 - Select best together with best and below best were firm to\nlower. Poorer sorts held firm.\n\nOP1 - Select best were firm. Best and below best were irregular. Poorer\nsorts were firm to dearer.\n\nOP/OPA  - Select best and best were firm. Below best and poorer sorts\nwere firm to lower.\n\nPEKOE/PEKOE1 - Select best PEK's were firm whilst best and below\nbest were easier. Select best and best PEK1's were firm whilst best and\nbelow best were firm to dearer.\n\nFBOP/FBOP1 - Select best and best were lower, whilst others were\ndrastically lower.\n\nBOP - All round firm.\n\nBOPF - All-round declined\n\nFBOPF/FBOPF1 - All around FBOPF’s were lower at times unsellable.\nSelect best and best FBOPF1's were firm whilst others were barely\nsteady.\n\nOff Grades\n\nFGS/FGS1 - High growns were firm to Rs. 10-20/- per kg dearer.\nMedium and low growns were firm to Rs. 10-20/- per kg dearer. CTC's\nmaintained.\n\nBM - Cleaner varieties were dearer by Rs. 20-40 /- per kg. Below best\nand the bottom gained by Rs. 10-20/- per kg.\n\nBP -  In general, dearer by Rs.20-40/- per kg.\n\nBOP1A - Select best were firm to dearer by Rs. 20/- per kg whilst all\nothers maintained.\n\nDUST Grades\n\nDUST1 - Best were firm to dearer by Rs.20/- per kg. Below best\nmaintained. CTC’s were irregular. Best and below best low growns\nmaintained.\n\nDUST - Cleaner secondaries were irregular. Low growns were firm on\nlast.\n\nTop Prices  - Sale No.24 of 24th / 25th June 2025\n\nFuture Sales Information (Sale No.25 of 07th & 08th July 2025)\n\n  Awaiting Sale – Catalogue Details\n\nSALE NO. 27 –  15TH & 16TH JULY 2025\n\nEx-Estate catalogue and Main Sale catalogues are scheduled to be\nclosed on the 26th June 2025\n\n\nSALE NO. 28 –  22ND & 23RD JULY 2025\n\nEx-Estate catalogue and Main Sale catalogues are scheduled to be\nclosed on the 03rd July 2025\n\n\nSALE NO. 29 –  29TH & 30TH JULY 2025\n\nEx-Estate catalogue and Main Sale catalogues are scheduled to be\nclosed on the 11th July 2025\n\nElevation Wise – Statistics – Colombo Auction Averages\n\nWorld Tea Production (In Million Kilos)\n\nSri Lanka Tea Exports – May 2025\n\nThe total quantity of tea exported for the month of May 2025 including\nRe-Exports with imported Tea amounted to 21.87 Mn/kg, recording an\nincrease of +2.42 Mn/kg (+12.44%) compared to the same period last\nyear. The FOB price per Kg for the month was LKR 1,804.31 vis-à-vis\nLKR 1,772.24 (+LKR 32.08). Total export earnings recorded an increase\nof LKR 4.99 billion (14.48%) in 2024 as compared to the same month\nlast year.\n\nCumulative exports for the period January to May 2025 including Re-\nExports with imported Tea amounted to 103.28 Mn/kg, showing an\nincrease of 5.13 Mn/Kg (5.22%) compared to last year. The FOB price\nper Kg for January to May 2025 recorded LKR 1,756.46 vis-à-vis LKR\n1,772.33 for the corresponding period in 2024 (-LKR 15.87). Total export\nvalue for the period under reference showed an increase of +LKR 7.45\nbillion (+4.28%) compared to 2024.\n\nEquivalent USD export earnings for the cumulative period January to\nMay 2025 amounted to approximately USD 565.36 million compared\nwith 610.06 million in the same period last year showing an increase of\napproximately USD 44.70 million.\n\nCountry wise analysis of exports reveals that Iraq has emerged as the\nlargest export destination from Sri Lanka followed by Libya and Russia.\n\nOther Markets\n\nMombasa Auction of 23rd / 24th June 2024\n\nThere was less demand at irregular rates for the 214,738 packages\n(14,514,011.00 kilos) on offer with 49.72% unsold.\n\nThere was strong enquiry from Pakistan Packers with less interest from\nYemen, other Middle Eastern countries, Kazakhstan and other CIS\nstates. Afghanistan reduced activity with some support from Bazaar.\nEgyptian Packers were active but at lower levels with less absorption\nfrom UK and Russia. Sudan were absent  with South Sudan less active.\nLocal Packers were selective on price with Somalia more active at the\nlower end of the market.\n\n \n\nLEAF GRADES (M2 & M3)\n\n \n\nBP1: Best - Continued irregular and varied between USC52 above\nprevious rates to easier by a similar margin. Brighter - Firm to USC10\ndearer with some invoices gaining up to USC27 but select lines shed up\nto USC8. Mediums - KTDA mediums were steady where sold but some\nteas lost up to USC20. Plantation mediums were easier by up to USC15\nbut a few lines were up to USC34 dearer. Lower Medium - Saw irregular\nsupport ranging between firm to USC9 dearer to easier by up to USC8.\nPlainer - Lost up to USC20 but select invoices were up to USC6 dearer.\n\nPF1: Best - Were irregular and ranged between firm to USC6 dearer to\neasier by up to USC18. Brighter - Steady to mostly dearer by up to\nUSC23 to easier by up to USC2. Mediums - KTDA mediums were firm to\ndearer by up to USC28; plantation mediums appreciated by up to\nUSC15 to easier by up to USC16. Lower Medium - Mostly gained up to\nUSC10. Plainer - Saw irregular interest and ranged between USC9\ndearer to mostly easier by up to USC12.\n\n \n\nDUST GRADES (M1)\n\n \n\nPDUST: Best - Saw irregular interest ranging between steady to USC18\nabove previous levels to easier by up to USC29. Brighter - Irregular\nranging between USC2 dearer to easier by up to USC8. Mediums -\nKTDA mediums mostly held value to USC6 above previous levels to\neasier by USC4 with plantation mediums discounted by up to USC12.\nLower Medium - Irregular varying between firm to USC8 dearer to\neasier by a similar margin. Plainer - Lost up to USC13.\n\nDUST1: Best - Mostly easier by up to USC9 but select teas appreciated\nby up to USC10. Brighter - Were irregular and varied between USC3\nabove previous rates for select invoices to mostly easier by up to\nUSC26.  Mediums - KTDA mediums met irregular interest at firm to\nUSC16 dearer to easier by up to USC10 with  plantation mediums\nshedding up to USC11 but a few select lines gained up to USC5. Lower\nMedium - Were irregular at firm to USC3 dearer to USC8 below last\nlevels. Plainer - Easier by up to USC9.\n\n \n\nSECONDARY GRADES (S1) : In the Secondary Catalogues, BPs met\nirregular enquiry with PFs steady to dearer. Clean well sorted coloury\nFannings gained while similar DUSTs tended easier. Other Fannings\nwere firm to irregularly dearer while DUSTs held vale. There was useful\nabsorption for BMFs.\n\n \n\n(Courtesy - Africa Tea Brokers Ltd)\n\nJakarta Auction of 20th June 2025\n\nCTC LEAF\n\nThe total CTC leaf teas sold this week was 75.46%(1,344,268.76kgs) of\nthe total offering of 1,781,465.53Kgs\n\n\nDemand: Selective\n\nMarket: Best & good category teas continue to sell at irregular levels\nbased on quality. Select invoices of better medium category, medium,\nsmaller broken & fanning grade on the top end sold firm to dearer whilst\nbulk of the other teas eased by up to Rs 4 to 5. Medium and plainer\nteas saw a sharp decline in prices with select blacker fanning grade\nfetching barely steady prices.\n\nBuying Pattern: Regional & internal small packateers along with\nselective western India buyers were active on best & good teas and\ncompeting for select improved invoices. Major blenders and the\nWestern India packateer were fairly active on better medium, medium &\nplainer teas but at easier levels. Other internal buyers continue to be\nselective. Iraqi exporters continued to be selective on the larger and\nmedium broken. CIS & Russia too were selective on their purchases.\nThe major blenders off take was 48.19% of the total CTC leaf sold.\n\n\nORTHODOX LEAF\n\nDemand: Fair\n\nMarket: High grown & other whole leaf sold at irregular levels following\nquality. High grown broken saw reduction in prices whilst the others\nsold barely steady. Fanning grades too sold at firm to dearer prices\nclosely following quality.\n\nBuying Pattern: Russian and CIS buyers were fairly active along with\nInternal buyers.\n\n\nCTC DUST\n\nDEMAND: Subdued especially with progress of the sale.\n\nMARKET: CTC dust offer this week was at 576,861.21Kgs of which\n376,660.35kgs were sold (65.29%).  Best & good teas sold at irregular\nprices closely following quality and competition. Better medium teas\nsold easier by Rs 3 to 5, larger difference was witnessed on the bolder\ndust. Medium and plainer dust eased by Rs 2 to 4 however larger\npercentage of teas in this segments were out listed due to want of bids.\n\nBUYING PATTERN: Major blenders continued to be selective. Regional\nand local packeteers were fairly active selectively on blacker types. Up\ncountry buyers were subdued. Less participation from the exporters\nwere seen this week.\n\n\nORTHODOX DUST\n\nDEMAND: Good demand on primary dust, secondary met with selective\ndemand.\n\nMARKET: Primary dust sold dearer on quality and competition &\nsecondary teas sold irregular and easier.\n\nBUYING PATTERN: Regional & local packateers were fairly active on\nprimary dusts. Exporters were selective on the secondary dusts.\n\n\n(Courtesy - J.Thomas & Co. Pvt. Ltd)\n\n \n\n  Bangladesh Auction of 23rd June 2025\n\nCTC LEAF: 46,384 packages of tea on offer met with a better demand.\n\n \n\nBROKENS/FANNINGS: Well-made good liquoring varieties met with\nmore competition and were mostly firm  to slightly dearer selling\nbetween Tk. 260/- and Tk.300/-. Below best also witnessed more\ndemand and sold between Tk.250/- and Tk.255/-. All others also sold\nwell between Tk. 245/- and Tk.250/-. BLF teas continued to meet with\nmore demand and sold between Tk.170/- and 223/-.\n\n \n\nDUST: 10,710 packages of tea on offer met with a good demand. Good\nliquoring Dusts sold well at around last levels. Mediums were again a\ngood market but price eased slightly. Plain/BLF Dusts sold quite well\nwith a few withdrawals. Blenders lent good support with fair interest\nfrom the Loose tea buyers.\n\n \n\nCOMMENTS: Market opened on a strong note and witnessed more\ncompetition compared to last particularly for well-made good liquoring\nvarieties which were the bright feature of the sale. Blenders lent strong\nsupport with more interest from the Loose tea buyers. However,\ndemand slackened gradually with the progress of sale during the\nsecond half.\n\n \n\nDusts sold well.\n\n \n\n(Courtesy - National Brokers Limited)\n\nKolkata Auction of 24th June 2025\n\nKOLKATA SALE CTC MARKET\n\n \n\nMARKET REPORT:\n\nLiquoring Assams firm to dearer. Medium and plainer teas not seen yet.\n\n \n\nBUYING PATTERN:\n\nWestern India: Active\n\nHUL: Operating\n\nTCPL: Quiet so far\n\nExporters: Fair enquiry\n\nOther local/internal: Operating\n\n \n\n KOLKATA SALE  ORTHODOX MARKET\n\n \n\nMARKET REPORT:\n\nMarket opened to improved demand. Nominal quantity of tippy teas on\noffer readily  absorbed. Clean well-made Whole leaf and Brokens seeing\nimproved participation and selling irregular around last. Remainder\nWhole Leaf and Brokens tending irregularly lower and at  times seeing\nsome withdrawals. BPS, BOP, FOP, OP, and Secondaries witnessing\ngood demand and selling at levels similar and at times higher to last.\nFannings irregular and at times tending lower.\n\n \n\nBUYING PATTERN:\n\nMiddle East : Improved enquiry\n\nCIS:  Good Support\n\nHUL: Very Selective\n\n \n\n(Courtesy -J Thomas & Company Private Limited)\n\nGuwahati Auction of 25th June 2025\n\nMarket:\n\nGood demand for the good and best Assams at around last levels. Fair\ndemand for the remainder at irregular levels following quality. ( PAR\nrunning at 82%)\n\nBuying Pattern:\n\nHUL/ Western India active. Internal, Exporters operating.\n\n(Courtesy - Associated Brokers Pvt. Ltd)\n\nMalawi Auction\n\nThe above market report details were not available at the time of\nprinting this publication.\n\nView more\nby scrolling down or swiping.\nHere's a tip: View more by scrolling down or swiping, or by using the arrow keys.",
    "embedded_bi_data": [],
    "bi_extraction_summary": {
        "total_bi_objects": 0,
        "successful_extractions": 0,
        "failed_extractions": 0
    }
}