{
    "report_title": "Market Report – 26th & 27th August 2025",
    "sale_week_number": "26",
    "year": "2025",
    "source_url": "https://sway.cloud.microsoft/zO5bN0aMmHkfnDYG?ref=Link",
    "report_page_url": "https://ceylonteabrokers.com/market-report-26th-27th-august-2025/",
    "retrieval_date": "2025-09-18T08:35:57.080285+00:00",
    "raw_text": "Accessibility View\nShare\n\nTMR.033\n\nThis week's Tea News\n\nCeylon Tea exports gain momentum in July\n\nSip your way to better health with the best green tea for 2025\n\nTea Statistics\n\napp.powerbi.com\napp.powerbi.com\n\nMarket movement at International Auction Centers this week\n\nCurrency – As of 27th August 2025\n\nElevation Average (August 03rd Sale)\n\nHigh Grown    \nRs.1,126.54     USD 3.73\n\nMedium Grown   \nRs.1,019.08     USD 3.37\n\nLow Grown  \nRs.1,254.42     USD 4.15\n\nTotal\nRs.1,188.77     USD 3.93\n\nQuantity Sold during the period 18th - 23rd August 2025\n\nTea Tech Tips\n\nTea Roller speed, cone profile and height, condition of battens, duration\nof rolling and degree of wither will determine the style, size and grade\npercentages of the resulting finished product.\n\nCrop & Weather (For the period 19th  - 26th August 2025)\n\nThe Western and Nuwara Eliya planting districts experienced bright\nconditions throughout the week. The Department of Meteorology\nforecasts scattered showers to be expected in both regions.\n\nUva/Udapussellawa's experienced sunny conditions. Rain be expected\nin both districts.\n\nThe Low growns reported bright conditions. Showers are to be expected\nin the Low grown districts.\n\nThe Western and Nuwara Eliya's maintained their crop intakes whilst\nthe Uva/Udapussellawa and Low grown districts reported a decline.\n\nWeather Forecast (For the period 28th August - 03rd September 2025)\n\nHoliday Notice\n\nPlease note that our Head Office, Warehouse & Sample Room will be\nclosed for business on the  following day:\n\nFriday 05th September, 2025 - Milad-Un-Naby (Holy Prophet's\nBirthday)\n\nThis Week's Market Movement at Colombo Tea Auction\n\nOrder of Sale this week\n\nDemand: Ex-Estate met with good demand at irregular rates. Good demand prevailed\nfor Low Growns.\n\nHigh Grown Teas\n\nBOP - Best Western's were mostly easier by Rs. 20-40/- per kg. In the\nBelow Best category, teas in the higher price bracket declined by Rs.\n20-40/- per kg, whilst others held firm. Teas at the lower end of the\nmarket were firm to dearer by a similar margin. Nuwara Eliya's were\nmostly unsold. Uda Pussellawa's moved up by Rs. 50/- per kg and more.\nUva's - Seasonal teas continued to sell well between Rs. 2,400-2,900/-\nper kg, whilst the non-seasonal types continued to sell around last\nweek's levels.\n\nBOPF - Best Western's – A few selected high priced teas were firm to\ndearer by Rs.50/- per kg, whilst others were irregular following quality.\nIn the Below Best category, prices for teas in the higher price bracket\nwere irregular following quality, whilst others sold around last week's\nlevels. Teas at the lower end of the market were generally firm. Nuwara\nEliya's were mostly unsold. Uda Pussellawa's were Rs. 20-40/- per kg\ndearer. Uva's - Seasonal teas sold well though lower to last with prices\nranging between Rs.1,800-1,900/- per kg, whilst the non-seasonal types\ncontinued to sell around last week's levels.\n\nMedium Grown Teas\n\nBOP1 - Select best and best moved up by Rs. 50/- per kg whilst all\nothers held firm.\n\nOP1 - Select best and best moved up by Rs. 50/- per kg whilst all\nothers held firm.\n\n\nPEK - Overall maintained.\n\nPEK1 - In general, moved up by Rs. 50/- per kg.\n\nOP/OPA - Select best were dearer by Rs. 50/- per kg whilst all others\nmaintained.\n\nFBOP- Select best held firm. Best gained by Rs. 50/- per kg whilst all\nothers maintained.\n\nFBOPF1 - In general held firm.\n\nCTC Teas\n\nHIGH GROWN\nBP1s - Hardly any offerings.\nPF1s - Mostly firm.\n\nMEDIUM GROWN\nBP1s - Irregular.\nPF1s - Mostly firm, whilst select invoices in the Below Best category\nappreciated.        \n\nLOW GROWN\nBP1s - Sold well.\nPF1s - Firm and tended dearer.\n\nLow Grown Teas\n\nBOP1 - Select best were firm whilst the best, below best and poorer\nsorts were irregular.\n\nOP1 - Select best were firm to lower, whilst others were firm.\n\nOP/OPA  - Select best and best were firm. Below best and poorer sorts\nwere irregular.\n\nPEKOE/PEKOE1 - Select best PEK's were firm, whilst best and below\nbest were firm to dearer. Select best and best PEK1's were firm whilst\nbest and below best were firm to dearer.\n\nFBOP/FBOP1 - Select best and best were lower, whilst others were\nbarely steady.\n\nBOP - All round held firm to dearer.\n\nBOPF - All-round held firm.\n\nFBOPF/FBOPF1 - All around FBOPF’s were firm to lower. Select best\nand best FBOPF1's were firm, whilst others were marginally dearer.\n\nOff Grades\n\nFGS/FGS1 - High growns were firm to Rs. 20-40/- per kg dearer.\nMedium and low growns were dearer by Rs. 10-20/- per kg. CTC's\nmaintained.\n\nBM - Cleaner varieties were firm to Rs. 10-20/- per kg dearer. Below\nbest and bottom maintained.\n\nBP -  Cleaner varieties were lower by Rs.20-30/- per kg whilst the rest\nheld firm.\n\nBOP1A - Select best were firm to dearer by Rs.50-70/- per kg. Below\nBest together with the poorer sorts were firm to lower by Rs.20/- per\nkg.\n\nDUST Grades\n\nDUST1 - Best and below best gained by Rs. 30 -60/- per kg. Best low\ngrowns maintained whilst below best were irregular.\n\n\nDUST - Cleaner secondaries and Low growns maintained.\n\nTop Prices  - Sale No.33 of 26th / 27th August 2025\n\nFuture Sales Information (Sale No.34 of 01st & 02nd September 2025)\n\n  Awaiting Sale – Catalogue Details\n\nSALE NO. 36 –  16TH & 17TH SEPTEMBER 2025\n\nEx-Estate catalogue and Main Sale catalogues are scheduled to be\nclosed on the 28th  August 2025\n\n\nSALE NO. 37 –  23RD & 24TH SEPTEMBER 2025\n\nEx-Estate catalogue and Main Sale catalogues are scheduled to be\nclosed on the 04th September 2025\n\n\nSALE NO. 38 –  29TH &  30TH SEPTEMBER 2025\n\nEx-Estate catalogue and Main Sale catalogues are scheduled to be\nclosed on the 11th September 2025\n\nElevation Wise – Statistics – Colombo Auction Averages\n\nWorld Tea Production (In Million Kilos)\n\nSri Lanka Tea Exports – July 2025\n\nThe total quantity of tea exported for the month of July 2025 including\nRe-Exports with imported Tea amounted to 24.04 Mn/kg, recording an\nincrease of +2.68 Mn/kg (+12.56%) compared to the same period last\nyear. The FOB price per Kg for the month was LKR 1,766.51 vis-à-vis\nLKR 1,773.70 (-LKR 7.19). Total export earnings recorded an increase of\nLKR 4.59 billion (12.11%) in 2024 as compared to the same month last\nyear.\n\nCumulative exports for the period January to July 2025 including Re-\nExports with imported Tea amounted to 150.85 Mn/kg, showing an\nincrease of 10.38 Mn/Kg (7.39%) compared to last year. The FOB price\nper Kg for January to July 2025 recorded LKR 1,748.51 vis-à-vis LKR\n1,771.45 for the corresponding period in 2024 (-LKR 22.94). Total export\nvalue for the period under reference showed an increase of +LKR 14.92\nbillion (+6.00%) compared to 2024.\n\nEquivalent USD export earnings for the cumulative period January to\nJuly 2025 amounted to approximately USD 884.30 million compared\nwith 811.63 million in the same period last year showing an increase of\napproximately USD 72.68 million.\n\nCountry wise analysis of exports reveals that Iraq has emerged as the\nlargest export destination from Sri Lanka followed by Libya and Russia.\n\nOther Markets\n\nMombasa Auction of 25th / 26th August 2025\n\nThere was good general demand for 153,360 packages (10,376,062.00\nkilos) on offer with 37.19% unsold.\n\n \n\nPakistan Packers were active but at lower levels with more interest\nfrom Yemen and other Middle Eastern countries. There was maintained\nparticipation from Afghanistan and Egyptian Packers. Kazakhstan and\nother CIS states lent support with Bazaar maintaining enquiry although\nwere quite selective. UK were more active with Russia showing less\ninterest and were quite selective. Sudan and South Sudan remained\nabsent. Local Packers operated selectively while Somalia continued\nactive at the lower end of the market.\n\n \n\nLEAF GRADES (M2 & M3)\n\n \n\nBP1: Best – Were irregularly absorbed with select lines gaining by up to\nUSC39 while others were easier by up to USC41. Brighter – Firm to\neasier with few invoices shedding up to USC48 while the remainder\nranged between USC10 to USC45 dearer. Mediums – KTDA mediums\nwere dearer with select teas advancing by up to USC10 while a few\nlines eased by up to USC12; plantation mediums appreciated by up to\nUSC18. Lower Medium – Were firm to USC18 above previous rates.\nPlainer – Steady and varied between USC8 to USC27 dearer to easier\nby up to USC12.\n\n \n\nPF1: Best – Met irregular interest and ranged between firm to USC24\nabove previous levels while some lines shed up to USC20. Brighter –\nWere generally easier by up to USC20 with a few invoices gaining by\nUSC6 to USC24. Mediums – KTDA mediums were steady to dearer by\nup to USC19 while some teas shed by USC2 to USC12. Plantation\nmediums appreciated by up to USC10. Lower Medium – Were firm to\neasier by up to USC17. Plainer – Some irregular interest varying\nbetween steady to dearer by USC3 to USC11 while select lines lost up\nto USC8.\n\n \n\nDUST GRADES (M1)\n\n \n\nPDUST: Best – Were irregular ranging between USC3 to USC11 dearer\nto easier by up to USC18. Brighter – Firm to dearer by up to USC12 but\na few invoices shed up to USC8.   Mediums – KTDA mediums were\nsteady to USC8 dearer with a select few gaining up to USC16 to mostly\neasier by up to USC17 with plantation mediums appreciating by up to\nUSC9.   Lower Medium – Dearer by up to USC15 but few selected teas\nwere firm to USC6 easier.   Plainer – Met strong support ranging\nbetween USC14 above previous rates to easier by up to USC11.\n\n \n\nDUST1: Best – Met irregular interest and varied between firm to USC18\nabove previous levels to easier by up to USC15.  Brighter – Were firm to\neasier by up to USC7 but a select few gained by up to USC32. Mediums\n– KTDA mediums met more irregular enquiry ranging between USC9 to\nUSC18 above previous rates to easier by USC14 with plantation\nmediums up to USC9 dearer. Lower Medium – Up to USC8 dearer to\neasier by up to USC4. Plainer – Some irregular interest varying between\nsteady to USC11 dearer to USC3 below previous rates.\n\n \n\nSECONDARY GRADES (S1)\n\nIn the Secondary Catalogues, best BPs were barely steady while others\nwere discounted; PFs tended dearer. Clean well sorted coloury Fannings\nappreciated with similar DUSTs mostly selling above previous levels.\nOther Fannings held value while DUSTs gained. BMFs were well\nabsorbed.\n\n(Courtesy - Africa Tea Brokers Ltd)\n\nBangladesh Auction of 25th August 2025\n\nCTC LEAF: 53,076 packages of tea on offer met with a fairly good\ndemand.\n\nBROKENS: Well made good liquoring BOPs were in good demand and\nwere generally firm on last. Smaller varieties in this category were well\nsought after at generally firm rates. Medium and plain types met with a\nfair demand with more withdrawals. BLF teas met with fair demand but\nthere were several withdrawals.\n\nFANNINGS: All good liquoring Fannings met with a fairly good demand\nbut eased a little whilst Medium types met with fair interest and held\nlast levels. Plain types were in less demand and there were again fair\nwithdrawals. BLF teas met with fair demand but there were several\nwithdrawals.\n\nDUST: 13,567 packages of tea on offer met with a fair demand. Good\nliquoring Dusts sold at around last levels. Mediums again were an\neasier market with Tk.3/- to Tk.5/- less than last. Plain/BLF Dusts\nwere a fair market with some withdrawals. Blenders lent strong support\nwith fair interest from the Loose tea buyers.\n\nCOMMENTS: Blenders were fairly active this week but there was less\ncompetition from Loose tea buyers. As a result the absorption was less\nand consequently there were more withdrawals.\n\nDusts were a fair market.\n\n(Courtesy - National Brokers Limited)\n\nMalawi Auction of 27th August 2025\n\nThere was less and selective interest at irregular rates for the 4740\npackages on offer following quality.\n\n BP1 met strong demand and sold up to 15USC dearer.\n\n PF1 - Few selected invoices were firm to dearer.\n\n PD - Selected invoices sold 5-15USC below valuation.\n\n D1 tended firm to 3USC easier.\n\n PF1SC - N/A.\n\n Secondary fngs fetched 5-7USC below valuation, dusts were neglected.\n\n\n(Courtesy - Tea Brokers Central Africa Limited)\n\nGuwahati Auction of 19th August 2025\n\nMarket: CTC\n\nDemand was just fair. All categories tended easier and with significant\nwithdrawals.\n\n \n\nBuying Pattern: CTC.\n\nHUL lent fair support. TCPL, Western India, North India buyers, other\nblenders operated. Exporters were seen on the larger brokens.\n\n \n\nMarket: DUST\n\nThere was fair demand at generally easier levels and with noticeable\nwithdrawals.\n\n \n\nBuying Pattern: DUST\n\nHUL, TCPL, Western India, North India, other packeteers operated.\n\n \n\n(Courtesy - Associated Brokers Pvt. Ltd)\n\nJakarta Auction of 23rd August 2025\n\nThe total CTC leaf teas sold this week was 79.62%(1211750.56kgs) of\nthe total offering of 1521930.25Kgs\n\nDEMAND : Good demand.\n\nMARKET : Best category prices were erratic closely following quality.\nGood teas met with very selective demand with prices irregular and\neasier and also few out lots due to want of bids. Better medium &\nmedium sorts ruled a barely steady to easier prices. Select blacker\nfanning in this category sold dearer on competition. Plainer sorts sold\nbarely steady prices.\n\nBUYING PATTERN : Regional & local buyers were fairly active on best\ncategories but selective on good teas. Major blenders and up country\nwere active on the remainders. Exporters to Russia, CIS and middle east\nwere active on the medium and plainer sorts. Iraqi shippers were active\non larger broken at the lower level. Major blenders picked up 42.57% of\nthe CTC Leaf sold.\n\n \n\nORTHODOX LEAF\n\nDEMAND : Good Demand.\n\nMARKET : High grown:- Well made, clean whole leaf & broken sold\ndearer on competition but the lower end saw a slight decline. Fanning\ngrade were easier by Rs 2 to 5. Others category all teas sold at barely\nsteady prices.\n\nBUYING PATTERN : CIS buyers were active on cleaner blacker\nvarieties along with Internal buyers. Shippers to middle east operated\non select whole leaf grades and broken. Internal were very choosy.\n\n \n\nCTC DUST\n\nDEMAND : Good demand.\n\nMARKET : CTC dust offer this week was at 363055.22Kgs of which\n337933.01kgs were sold (93.08%). Best category dust sold barely\nsteady. Good teas were irregular. Remainders sold fully firm to dearer\nespecially the finer dust.\n\nBUYING PATTERN : Regional and local packers were selective on the\nbest & good teas. Exporters to Russia, Middle east continued to be\nactive on blacker sorts. Other up country buyers were rather choosy.\n\n \n\nORTHODOX DUST\n\nDEMAND : Selective demand.\n\nMARKET : High grown primary dust fetched barely steady prices.\nClean, medium grown teas sold firm dearer whilst others were\ndiscounted. Secondaries were barely steady to easier.\n\nBUYING PATTERN : Regional & local packers were selective on\nprimary dusts. Exporters were very choosy at steady to easier prices on\nthe secondary dusts.\n\n \n\n(Courtesy - J Thomas & Company Private Limited)\n\nKolkata Auction\n\nThe above market report details were not available at the time of\nprinting this publication.\n\nView more\nby scrolling down or swiping.\nHere's a tip: View more by scrolling down or swiping, or by using the arrow keys.",
    "embedded_bi_data": [],
    "bi_extraction_summary": {
        "total_bi_objects": 0,
        "successful_extractions": 0,
        "failed_extractions": 0
    }
}