{
    "report_title": "Market Report – 29th & 30th July 2025",
    "sale_week_number": "29",
    "year": "2025",
    "source_url": "https://sway.cloud.microsoft/nIvDdG04uq9Ha8Q0?ref=Link",
    "report_page_url": "https://ceylonteabrokers.com/market-report-29th-30th-july-2025/",
    "retrieval_date": "2025-09-17T19:45:20.484028+00:00",
    "raw_text": "Accessibility View\nShare\n\nTMR.29\n\nThis week's Tea News\n\nBenefits of drinking tea: 9 ways it can work wonders for your health\n\nLargest Ceylon black tea producer embraces mechanization, drone technology and AI\namidst labor shortage\n\nTea Statistics\n\napp.powerbi.com\napp.powerbi.com\n\nMarket movement at International Auction Centers this week\n\nCurrency – As of 30th July 2025\n\nElevation Average (July 04th Sale)\n\nHigh Grown     \nRs.1,043.47    USD 3.45\n\nMedium Grown \nRs.981.20        USD 3.25\n\nLow Grown    \nRs.1,207.32    USD 4.00\n\nTotal    \nRs.1,131.61    USD 3.75\n\nQuantity Sold during the period 21st - 26th July 2025\n\nTea Tech Tips\n\nHeat during processing of leaf is detrimental to the quality of the\nproduct. Process leaf during the early hours of the day, take other\nmeasures such as humidifiers, wet curtains in the rolling and\nfermenting areas.\n\nCrop & Weather (For the period 23rd- 29th July 2025)\n\nThe Western and Nuwara Eliya planting districts experienced rain\nthroughout the week. The Department of Meteorology forecast showers\nto be expected in both regions.\n\nUva/Udapussellawa's experienced sunny conditions. Thunder showers\nare to be expected in both districts.\n\nLow growns reported sunny mornings followed by occasional evening\nshowers. Scattered showers are to be expected in the Low grown\ndistricts.\n\nAll regions reported a decline in their crop intakes except for the\nNuwara Eliya's which recorded an increase.\n\nWeather Forecast (For the period 31st July - 06th August 2025)\n\nThis Week's Market Movement at Colombo Tea Auction\n\nOrder of Sale this week\n\nDemand: Ex-Estate met with lower demand. Firm demand prevailed for Low Growns.\n\nHigh Grown Teas\n\nBOP - Best Westerns were irregular and easier by Rs. 50/- per kg and\nmore. In the Below Best category, a few invoices held firm, whilst others\nwere irregular. Teas at the lower end were firm to lower by Rs.20/- per\nkg. Uda Pussellawa’s were irregularly easier and mostly unsold. Nuwara\nEliya’s were mostly unsold. Seasonal Uva’s sold well between Rs.\n2000-3000/- per kg range, whilst others were barely steady.\n\n \n\nBOPF - Best Westerns few selected invoices held firm, whilst others\ndeclined by Rs.20-40/- per kg or more. Below Best were firm to lower\nby Rs.20-40/- per kg. Teas at the lower end eased by Rs.20-30/- per kg.\nUda Pussellawa’s were irregular and easier. Nuwara Eliya’s were mostly\nunsold. Seasonal Uva’s sold well between Rs. 2000-2250/- per kg,\nwhilst others declined by Rs. 50/- per kg.\n\nMedium Grown Teas\n\nBOP1 - Select best moved up by Rs. 50/- per kg whilst all others held\nfirm.\n\nOP1 - Select best maintained. Best were lower by Rs. 50/- per kg.\nBelow best and others remained unchanged.\n\nPEK -  Select best appreciated by Rs. 50/- per kg. Best gained by Rs.\n20/- per kg. Below best and others held firm.\n\nPEK1 - Select best moved up by Rs. 50/- per kg. Best gained by Rs.\n150/-per kg. Below best were dearer by Rs. 100/- per kg whilst others\nappreciated by Rs. 50/- per kg\n\nOP/OPA - Select best lost by Rs. 50/- per kg. Best and below best\nmoved up by Rs. 20/- per kg. Others held firm.\n\nFBOP- Select best were dearer by Rs. 50/- per kg whilst all others\nmaintained.\n\nFBOPF1 - Select best held firm. Best and below best moved up by Rs.\n50/- per kg whilst others remained unchanged.\n\nCTC Teas\n\nHIGH GROWN\n\nBP1s - Hardly any offerings.\n\nPF1s - Better sorts were firm, whilst the others were irregular.\n\n \n\nMEDIUM GROWN\n\nBP1s - Irregular.\n\nPF1s - Better sorts were generally firm, whilst the others tended\nmarginally easier.\n\n \n\nLOW GROWN\n\nBP1s - Select invoices were dearer, whilst the others were barely\nsteady.\n\nPF1s - Better teas were firm and marginally dearer, whilst the\nsecondary types were marginally easier.\n\nLow Grown Teas\n\nBOP1 - Select best and best were firm, whilst best and poorer sorts\nwere irregular.\n\nOP1 - Select best and best were firm whilst below best and poorer\nsorts were firm to dearer.\n\nOP/OPA  - Select best and best were firm to dearer. Below best and\npoorer sorts were irregular.\n\nPEKOE/PEKOE1 - Select best PEK's were firm, whilst best and below\nbest were firm to dearer. Select best and best PEK1's were firm whilst\nbest and below best were firm to dearer.\n\nFBOP/FBOP1 - Select best and best were firm, whilst others were\ndearer.\n\nBOP - All round held firm.\n\nBOPF - All-round held firm.\n\nFBOPF/FBOPF1 - All around FBOPF’s were firm to dearer. Select best\nand best FBOPF1's were firm, whilst others were firm to dearer.\n\nOff Grades\n\nFGS/FGS1 - High growns were firm to Rs. 20-40/- per kg dearer.\nMedium and low growns were easier by Rs. 10-20/- per kg. CTC's were\nlower by Rs. 20-40/- per kg.\n\nBM - Cleaner varieties were firm to Rs. 10-20/- per kg dearer. Below\nbest and bottom were lower by Rs. 20-30/- per kg.\n\nBP -  In general eased by Rs. 20-40/- per kg.\n\nBOP1A - Select best were firm. Below Best were firm to lower by\nRs.20-30/- per kg and more, whilst the poorer sorts held firm.\n\nDUST Grades\n\nDUST1 - Best and below best were irregularly lower. CTC’s maintained.\nBest low growns appreciated by Rs. 20-40/- per kg. Below best low\ngrowns maintained.\n\n\nDUST - Cleaner secondaries irregular and Low growns maintained.\n\nTop Prices  - Sale No.29 of 29th / 30th July 2025\n\nFuture Sales Information (Sale No.30 of 04th & 05th August 2025)\n\n  Awaiting Sale – Catalogue Details\n\nSALE NO. 32 –  19TH & 20TH AUGUST 2025\n\nEx-Estate catalogue and Main Sale catalogues are scheduled to be\nclosed on the 31st July 2025\n\n\nSALE NO. 33 –  26TH & 27TH AUGUST 2025\n\nEx-Estate catalogue and Main Sale catalogues are scheduled to be\nclosed on the 07th August 2025\n\n\nSALE NO. 34 –  01ST & 02ND SEPTEMBER 2025\n\nEx-Estate catalogue and Main Sale catalogues are scheduled to be\nclosed on the 14th August 2025\n\nElevation Wise – Statistics – Colombo Auction Averages\n\nWorld Tea Production (In Million Kilos)\n\nOther Markets\n\nMombasa Auction of 28th / 29th July 2025\n\nThere was good general demand for the 186,120 packages\n(12,632,701.00 kilos) available in the market; 45.26% remained unsold.\n\n \n\nPakistan Packers were active while Yemen and other Middle Eastern\ncountries lent strong support. There was reduced activity from\nKazakhstan and other CIS states with maintained enquiry from\nAfghanistan and Bazaar. Egyptian Packers showed more and strong\ninterest with UK active but selective; Russia improved absorption.\nSudan were absent while South Sudan maintained activity. Local\nPackers reduced interest while Somalia were active at the lower end of\nthe market.\n\n \n\nLEAF GRADES (M2 & M3)\n\n \n\nBP1: Best – Irregular enquiry and varied between USC29 dearer to\neasier by up to USC18 with most teas remaining unsold. Brighter – Saw\nirregular interest and ranged between steady to USC20 dearer to easier\nby up to USC27. Mediums – KTDA mediums were firm to USC10 dearer\nto USC8 below previous levels with plantation mediums firm to USC37\ndearer for some lines to easier by up to USC20. Lower Medium – More\nirregular and ranged between steady to USC16 dearer to easier by up to\nUSC20. Plainer – Easier by up to USC9 but select teas gained up to\nUSC6.\n\n \n\nPF1: Best – More irregular and varied between USC22 above previous\nlevels to easier by up to USC27. Brighter – Were irregular and ranged\nbetween USC7 dearer to USC12 below last levels. Mediums – KTDA\nmediums were firm to USC11 dearer to easier by up to USC10;\nPlantation medium were irregular ranging between USC12 dearer to\nUSC8 below previous rates. Lower Medium – Were firm to USC9 above\nprevious rates to USC8 easier. Plainer – More irregular interest and\nvaried between USC4 dearer to mostly easier by up to USC15.\n\n \n\nDUST GRADES (M1)\n\n \n\nPDUST: Best – Gained up to USC26 but a few lines were easier by up to\nUSC6. Brighter – Saw irregular enquiry and varied between USC7 dearer\nto mostly easier by up to USC9. Mediums – KTDA mediums were steady\nto USC24 above previous levels to USC7 easier with plantation\nmediums appreciating by up to USC10. Lower Medium – Were dearer by\nup to USC10. Plainer – Mostly gained by up to USC6 but select invoices\nlost up to USC8.\n\n \n\nDUST1: Best – Were up to USC9 dearer to USC16 below previous\nlevels. Brighter – Irregular ranging between firm to USC8 dearer to\nmostly easier by up to USC14. Mediums – KTDA mediums were\nirregular and ranged between firm to USC8 above last levels to mostly\neasier by up to USC13. Plantation mediums advanced up to USC15 but\nselect lines were discounted by up to USC3. Lower Medium – Irregular\nranging between firm to USC6 dearer to easier by up to USC5. Plainer –\nWere up to USC5 above previous rates to easier by up to USC3.\n\n \n\nSECONDARY GRADES (S1) In the Secondary Catalogues, BPs were\nfirm with better made sorts dearer; PFs sold at about previous rates.\nClean well sorted coloury Fannings were steady to dearer while similar\nDUSTs were firm with some lines selling above previous levels. Other\nFannings were firm while DUSTs were irregular. BMFs were well\nabsorbed.\n\n \n\n(Courtesy - Africa Tea Brokers Ltd)\n\nJakarta Auction of 25th July 2025\n\nThe total CTC leaf teas sold this week was 76.43%(1,225,405.47kgs) of\nthe total offering of 1,603,275.35Kgs.\n\n\nDemand: Good and improved demand on all sorts except for the lower\nmedium and plainer teas which continue to meet with selective or\nrather reduced demand.\n\nMarket: The best, good & better medium teas sold at firm to dearer\nprices. Medium sorts stabilized at barely steady levels, except for the\nfanning grade which saw a slight decline in prices. Select plain teas\nheld on to last levels however, bulk of this category especially browner\nand fibrous sorts continued to face withdrawals.\n\nBuying Pattern:  Major blenders continued to be the mainstay of the\nCTC market with 45.66% off take with fair support from the Western\nIndia packer. Local & regional packers were active on the best and good\nliquoring sorts. Internal buyers continued to be subdued. Russian and\nCIS exporters along with the Middle east shippers increased their\npurchases especially on blacker sorts. Iraqi shippers too were fairly\nactive.\n\n \n\nORTHODOX LEAF\n\nDemand: Fair Demand.\n\nMarket: High grown whole leaf with good make and blacker sorts were\nfirm to dearer. Others were Rs 2 to 3 easier. Medium grown whole leaf\nsold irregularly, with cleaner broken ruling firm market. Fanning eased\nin value.\n\nBuying Pattern: CIS buyers were selective on cleaner blacker varieties\nalong with Internal buyers.Middle east shippers lent fair support on\nwhole leaf grades and broken.\n\n \n\nCTC DUST\n\nDemand:  Good improved demand. Reduced demand for the lower\nmedium and plainers..\n\nMarket: CTC dust offer this week was at 484,220.66Kgs of which\n372464.96kgs were sold (76.92%). Best & good teas sold dearer in line\nwith quality. Better medium & medium teas sold at fully firm rates.\nSelect lower medium and plainer teas sold at last levels however the\nbrowner sorts continued to face withdrawals.\n\nBuying Pattern:  Major blenders were fairly active. Regional and local\npackers were active on the best & good teas. Up country buyers were\nsubdued. Exporters to Russia, Middle east improved their purchases\nthis week on blacker sorts.\n\n \n\nORTHODOX DUST\n\nDemand: Good demand.\n\nMarket: High grown primary dust fetched irregular prices following\nquality, medium grown sold irregularly easier. Secondaries were barely\nsteady.\n\nBuying Pattern: Regional & local packateers were fairly active on\nprimary dusts. Exporters were very choosy at steady prices on the\nsecondary dusts.\n\n \n\n(Courtesy -J Thomas & Company Private Limited)\n\nBangladesh Auction of 28th July 2025\n\nCTC LEAF: 53,930 packages of tea on offer continued to meet with a\nstrong demand.\n\nBROKENS: All good liquoring Brokens were strongly competed for and\nprices were fully firm to touch dearer for selective lots. Withdrawals\nwere negligible in this category. Mediums were firm. Plain descriptions\nmet with some demand and were about steady but there were several\nwithdrawals. BLF teas met with a fairly good demand and were\ngenerally firm to occasionally dearer. There were a few withdrawals.\n\nFANNINGS: Best and good Fannings were a strong feature and were\nmostly firm whilst Mediums saw a steady demand and prices were also\nfirm on last. Plain varieties saw less demand there were many more\nwithdrawals. BLF teas met with a fairly good demand and were\ngenerally firm to occasionally dearer. There were several withdrawals.\n\n DUST: 13,064 packages of tea on offer met with good demand Good\nliquoring Dusts sold well at around last levels Medium and plainer sorts\nwere discounted and witnessed fair weight of withdrawals. BLFs\ncontinued to meet with a better demand with only a few withdrawals.\nBlenders lent strong support with fair interest from the Loose tea\nbuyers.\n\nCOMMENTS: Blenders continued to operate strongly but there was\nless support from the Loose tea buyers. Buyers once again followed\nquality closely whereby a selection of plainer types were neglected and\nwere subject to withdrawals. Dusts sold well.\n\n \n\n(Courtesy - National Brokers Limited)\n\nKolkata Auction of 29th July 2025\n\nKOLKATA SALE CTC MARKET\n\nMARKET REPORT:\n\nMarket opened to good demand. Liquoring Assams irregular around last\nlevels. Medium and plainer sorts tending easier. Dooars seen so far\nsimilar trend.\n\nBUYING PATTERN:\n\nWestern India - Supporting the better teas on offer\n\nHUL - Operating\n\nWest Bengal Manufacturing - Selective so far\n\nExporters - Fair enquiry\n\nOther local/internal – Operating\n\nKOLKATA SALE ORTHODOX MARKET\n\n \n\nMARKET REPORT:\n\nMarket opened to strong demand. Few tippy teas on offer sold readily.\nWell made Whole Leaf and Brokens selling at firm rates. Remainder\nWhole Leaf and Brokens irregular around last following quality.\nFannings and Cleaner Secondaries selling around last levels.\n\nBUYING PATTERN:\n\nMiddle East : Active\n\nCIS:  Good Support\n\nHUL: Selective\n\n\nKOLKATA SALE DUST MARKET\n\nMARKET REPORT:\n\nMarket opened to good demand. Liquoring sorts around last levels.\nRemainder barely steady and at times easier following quality.\n\nBUYING PATTERN:\n\nHUL: Active\n\nWest Bengal Manufacturing: Operating\n\nWestern India: Good Support\n\nLocal and Internal: Some enquiry.\n\n\n(Courtesy - J Thomas & Company Private)\n\nGuwahati Auction of 30th July 2025\n\nMarket:There is fair demand for the good and better medium Assams at\nirregular rates following quality. Plainer varieties are easier. Best\nAssams yet to be offered. ( TBG - 57% , ATB running at 61 %)Buying\nPattern:HUL / Western India / North India / Exporters operating.\n\n(Courtesy-Associated Brokers Pvt. Ltd)\n\nMalawi Auction\n\nThe above market report details were not available at the time of\nprinting this publication.\n\nView more\nby scrolling down or swiping.\nHere's a tip: View more by scrolling down or swiping, or by using the arrow keys.",
    "embedded_bi_data": [],
    "bi_extraction_summary": {
        "total_bi_objects": 0,
        "successful_extractions": 0,
        "failed_extractions": 0
    }
}