{
    "report_title": "Market Report – 27th & 28th May 2025",
    "sale_week_number": "27",
    "year": "2025",
    "source_url": "https://sway.cloud.microsoft/LgGSrA5nTrrLYP71?ref=Link",
    "report_page_url": "https://ceylonteabrokers.com/market-report-27th-28th-may-2025/",
    "retrieval_date": "2025-09-18T08:30:08.293405+00:00",
    "raw_text": "Accessibility View\nShare\n\nTMR.20\n\nThis week's Tea News\n\nCeylon Tea: Showcasing Sri Lanka’s Rich Heritage to the World – PM\n\n2025 Tea for Harmony: Yaji” series events kick off in Colombo\n\nTea Statistics\n\napp.powerbi.com\napp.powerbi.com\n\nMarket movement at International Auction Centers this week\n\nCurrency – As of 28th May 2025\n\nElevation Average (May 03rd Sale)\n\nHigh Grown\n\nRs.1,044.89     USD 3.49\n\n \n\nMedium Grown\n\n Rs.1,029.29    USD 3.43\n\n \n\nLow Grown\n\nRs.1,244.80     USD 4.15\n\n \n\nTotal\n\nRs.1,156.73     USD 3.86\n\nQuantity Sold during the period 19th - 24th May 2025\n\nTea Tech Tips\n\nPack Teas to retain the shape of the bag. Bulging bags will be\ndiscounted by the buyers.\n\nCrop & Weather (For the period 20th - 27th May 2025)\n\nThe Western and Nuwara Eliya planting districts experienced showers\nthroughout the week. The Department of Meteorology forecasts heavy\nrains to be expected in both regions.\n\nThe Uva/Udapussellawa's experienced bright mornings. Strong winds\nare expected in both districts.\n\nThe Low grown's reported rains throughout the week. Heavy showers\nare to be expected in the Low grown districts.\n\nAll regions maintained their crop intakes except for the Western high\nand Low grown planting districts which reported a decline.\n\nWeather Forecast (For the period 29th May  - 04th June2025)\n\nThis Week's Market Movement at Colombo Tea Auction\n\nOrder of Sale this week\n\nDemand: Ex-Estate met with selective and easier demand following quality whilst lower\ndemand prevailed for Low Growns.\n\nHigh Grown Teas\n\nBOP: Best Western’s – A few selected invoices were firm to dearer,\nwhilst others were irregular and easier by Rs.50/- per kg and at times\nmore. In the Below Best category, a few selected invoices appreciated\nRs.50/- per kg, whilst others dropped by a similar margin. Teas at the\nlower end were firm to dearer by Rs.20-40/- per kg. Nuwara Eliya’s\nwere lower by Rs.50/- per kg. Uda Pussellawa’s were firm to dearer by\nRs. 20-30/- per kg. Uva’s were firm to dearer by Rs.20-30 per kg.\n\nBOPF: Best Western’s – A few selected invoices appreciated following a\nspecial inquiry, whilst others were irregular and easier following quality.\nIn the Below Best category, a few selected invoices were dearer by\nRs.20-40 per kg, whilst others were irregular and easier. Plainer sorts\nwere irregular and easier. Nuwara Eliya’s held firm. Uda Pussellawa’s\nwere barely steady. Uva’s were lower by Rs.50/- per kg.\n\nMedium Grown Teas\n\nBOP1 - Select best and best were dearer by Rs. 50/- per kg whilst all\nothers held firm.Select best moved up by Rs. 50/- per kg. Best held\nfirm. Below best and others lost by Rs. 50/- per kg.\n\nOP1 - Select best and best remained unchanged. Below best were\ndearer by Rs. 50/- per kg. Others held firm.\n\nPEK -  Select best and best lost by Rs. 50/- per kg. Below best were\nlower by Rs. 100/- per kg whilst others were lower by Rs. 50/- per kg.\n\nPEK1 - Select best appreciated by Rs. 50/- per kg. Best held firm.\nBelow best and others were lower by Rs. 50/- per kg.\n\nOP/OPA - Overall, lost by Rs.40/- per kg.Select best were lower by Rs.\n50/- per kg whilst all others were easier by Rs. 20/- per kg.\n\nFBOP - Select best maintained. Best and below best were lower by Rs.\n50/- per kg. Others held firm.\n\nFBOPF1 - Select best remained unchanged whilst all others\nappreciated by Rs.50/- per kg.Select best held firm whilst all others\nwere lower by Rs. 50/- per kg.\n\nCTC Teas\n\nHIGH GROWN\nBP1s – Hardly any offerings.\nPF1s – Irregular and easier. \n\nMEDIUM GROWN\nBP1s – Irregular.\nPF1s – Teas in the higher price bracket dropped by Rs. 20-40/- per kg,\nwhilst others maintained. \n\nLOW GROWN\nBP1s – Irregular.\nPF1s – Lower by Rs.50/- per kg and more.\n\nLow Grown Teas\n\nBOP1 - Select best  were firm whilst best and below best were firm to\nlower. Poorer sorts held firm to dearer.\n\nOP1 - Select best were firm. Best and below best were irregular. Poorer\nsorts were firm to dearer.\n\nOP/OPA  - Select best were dearer. Best and below best were irregular.\nPoorer sorts were firm.\n\nPEKOE/PEKOE1 - Select best PEK's were firm whilst best and below\nbest were easier. Select best and best PEK1's were firm whilst below\nbest were firm to lower.\n\nFBOP/FBOP1 - Select best and best were firm, whilst others were\nlower.\n\nBOP - Select best and best types were firm to dearer whilst others\nwere marginally lower.\n\nBOPF - All-round lower.\n\nFBOPF/FBOPF1 - All around FBOPF’s were lower. Select best and best\nFBOPF1's were firm whilst Below best were lower to last.\n\nOff Grades\n\nFGS/FGS1 - High Growns were irregular. Medium Growns gained by\nRs.10-20/- per kg. Low Growns held firm. CTC's were irregular and\neasier.\n\nBM - Cleaner varieties were firm to dearer by Rs. 10-20/- per kg. Below\nbest and the bottom too moved up by Rs. 20/- per kg.\n\nBP -  In general, appreciated by Rs. 50-100/- per kg.\n\nBOP1A - Select best were firm to dearer by Rs.20/- per kg. Below best\ntogether with the poorer sorts moved up by Rs. 10-20/- per kg.\n\nDUST Grades\n\nDUST1 - Best and Below best were lower by Rs.50-60/- per kg, CTC's\nwere irregular. Best and Below best Low growns appreciated by Rs.20\n-30/- per kg.\n\nDUST - Cleaner secondaries and low growns were lower by Rs.20-40/-\nper kg.\n\nTop Prices  - Sale No.20 of 27th / 28th May 2025\n\nFuture Sales Information (Sale No.21 of 03rd & 04th June 2025)\n\n  Awaiting Sale – Catalogue Details\n\nSALE NO. 23 – 17TH & 18TH JUNE 2025\n\nEx-Estate catalogue and Main Sale catalogues are scheduled to be\nclosed on the 29th May 2025\n\n \n\nSALE NO. 24 – 24TH & 25TH JUNE 2025\n\nEx-Estate catalogue and Main Sale catalogues are scheduled to be\nclosed on the 05th June 2025\n\n \n\nSALE NO. 25 – 02ND & 03RD JULY 2025\n\nEx-Estate catalogue and Main Sale catalogues are scheduled to be\nclosed on the 12th July 2025\n\n \n\nElevation Wise – Statistics – Colombo Auction Averages\n\nWorld Tea Production (In Million Kilos)\n\nOther Markets\n\nMombasa Auction of 19th / 20th May 2025\n\nFairly improved general demand at irregular levels for the 206,458\npackages (14,074,519.00 kilos) on offer; 33.70% was unsold.\n\nPakistan Packers were active but at lower levels with more enquiry from\nYemen and other Middle Eastern countries. Kazakhstan and other CIS\nstates lent strong support  with some participation from Bazaar.\nAfghanistan were active with less enquiry from UK. Egyptian Packers\nlent good support at steady rates with some interest from Russia.\nSudan were absent while South Sudan maintained activity. Local\nPackers reduced enquiry with Somalia active at the lower end of the\nmarket.\n\n \n\nLEAF GRADES (M2 & M3)\n\nBP1: Best - Saw very irregular interest and varied between USC16\ndearer with some teas USC42 and USC80 above previous levels to\neasier by USC26 and some lines were further discounted by USC38 and\nUSC59. Brighter - Were up to USC19 dearer to easier by up to USC15.\nMediums - KTDA mediums were irregular varying between USC12\ndearer with some invoices up to USC22 above last rates to easier by up\nto USC17 while better plantation mediums were well sought after\nappreciating by up to USC42. Lower Medium - Were steady to USC5\ndearer to easier by up to USC12. Plainer - Improved absorption at firm\nto USC10 above previous rates to easier by up to USC5.\n\nPF1: Best - Met irregular enquiry ranging between steady to USC22\ndearer to easier by up to USC14.\n\n Brighter - Mostly shed by up to USC28 but select invoices were up to\nUSC2 above previous rates.\n\n Mediums - KTDA mediums were irregular and varied between steady\nto dearer by up to USC7 to easier by up to USC16. Plantation mediums\nwere firm to USC4 above previous levels to easier by up to USC7. Lower\nMedium - Lost up to USC16 but some invoices gained by up to USC6.\nPlainer - Irregular enquiry and ranged between steady to USC31 dearer\nto easier by up to USC5.\n\n \n\nDUST GRADES (M1)\n\nPDUST: Best - Were well absorbed at irregular rates ranging between\nUSC16 dearer to easier by up to USC20. Brighter - Irregular and varied\nbetween mostly dearer by up to USC19 with some lines easier by up to\nUSC4. Mediums - KTDA mediums were USC15 above last levels to\neasier by up to USC10 with plantation mediums irregularly shedding by\nup to USC15. Lower Medium - Discounted by up to USC18. Plainer -\nMostly dearer by up to USC9 to USC1 below previous levels.\n\nDUST1: Best - Saw improved enquiry ranging between firm to USC22\ndearer to easier by USC4. Brighter - Steady to USC12 above previous\nlevels to easier by up to USC15. Mediums - KTDA mediums saw\nirregular enquiry at USC12 dearer to mostly easier by up to USC20 with\nplantation mediums up to USC22 above previous levels to easier by up\nto USC5. Lower Medium - Lost up to USC15 but select lines gained by\nUSC4. Plainer - Irregular and varied between firm to mostly dearer by\nup to USC6 to easier by up to USC8\n\nSECONDARY GRADES (S1)\n\nIn the Secondary Catalogues, best BPs tended easier with others steady\nwhile PFs were firm to irregularly dearer. Clean well sorted coloury\nFannings were steady to dearer with similar DUSTs selling at around\nprevious rates. Other Fannings tended dearer while DUSTs held value.\nBMFs were well absorbed.\n\n(Courtesy - Africa Tea Brokers Ltd)\n\nJakarta Auction of 19th May 2025\n\nMARKET: The total CTC leaf teas sold this week was 68.73\n%(1,280,621.31kgs) of the total offering of 1,863,312.73Kgs.\n\nBEST: Best liquoring larger broken sold irregularly following quality,\nmedium and smaller broken grades sold dearer following quality. There\nwere very limited fanning grade on offer. Local and Regional packagers\ncontinued to be fairly active.\n\nGOOD: Larger broken sold barely steady, medium and smaller broken at\nthe bottom end sold barely steady whilst select few invoices sold dearer\nfollowing quality. Very limited fanning grade was on offer and fetched\ndearer prices following quality and competition. Regional packagers,\nupcountry buyers were fairly active.\n\nBETTER MEDIUM & MEDIUM: Larger broken eased by Rs 4 to 6, The\ntop end medium and smaller broken sold barely steady to easier by Rs 2\nto 3 whilst the bottom end in this category declined sharply by Rs 4 to 6.\nThe prices continued to show no disparity between both the categories\nespecially on the medium and smaller broken grades. Fanning grade on\nthe better medium category fetched steady prices whilst the medium\ncategory sold easier by Rs 3 to 6. Major blenders and Western India\nPackateers were fairly active. Selective buying was seen from the\nupcountry and local buyers. Exporters were fairly active on on cleaner,\nblacker fanning. Larger broken continue to meet with selective buying\nfrom exporters.\n\nPLAINERS: Larger broken grades declined in value by Rs 4 to 6, the\nremainders eased by Rs 4 to 8 or more. Larger percentage of teas\nremain unsold in this segment. Limited buying from exporters. Major\nblenders were very choosy and internal buyers were selective along\nwith the upcountry buyers.\n\nBUYING PATTERN: The major blenders off take was 50.64% of the\ntotal CTC leaf sold.\n\n \n\nORTHODOX LEAF\n\nDEMAND: Good but selective demand.\n\n MARKET: Select well made clean high grown whole leaf sold steady to\neasier following quality, others faced withdrawals. Other category sold\nat irregular levels, the bottom end of this category saws some out lots.\nBroken grade of the high grown category sold around last sold levels\nwith select invoices fetching dearer prices whilst the others sold barely\nsteady to easier.Fanning grades were barely steady to easier.\n\nBUYING PATTERN: Exporters were selective this week with up country\nbuyers continuing to be fairly active closely following quality.\n\n \n\nCTC DUST\n\nDEMAND: Fair demand.\n\nMARKET: CTC dust offer this week was at 509,730.46Kgs of which\n388,707.22kgs were sold (76.26%).\n\n There were no bolder dust on offer in the best teas , other grades sold\nirregular and easier closely following quality. Good category teas sold\nirregularly easier. Better medium & medium teas were barely steady to\neasier by Rs 2 to 3. Plainer teas sold easier by Rs 2 to 6.\n\nBUYING PATTERN: Major blenders were fairly active. Regional and\nlocal packeteers were selective along with the Up country and the local\nbuyers . Exporters were fairly active on the bolder dust especially on\ncleaner and blacker sorts.\n\nORTHODOX DUST\n\nDEMAND: Good demand.\n\nMARKET: Primary dusts sold at irregular and dearer levels following\nquality, secondaries sold at irregular levels.\n\nBUYING PATTERN: Regional & local packateers were fairly active on\nprimary dusts. Exporters were selective on the secondary dusts.\n\n(Courtesy - J.Thomas & Co. Pvt. Ltd)\n\nBangladesh Auction of 26th May 2025\n\nCTC LEAF: 25,948 packages of tea on offer met with a strong demand.\n\nBROKENS/FANNINGS: Well made good liquoring types met with a\nstronger demand at mostly dearer rates and could be quoted between\nTk.280/- and Tk.310/-. Below best were also a fairly strong market and\nwere firm to slightly dearer selling between Tk.240/- and Tk.260/-. All\nother varieties were in good demand and were generally firm and these\ncould be quoted between Tk.200/- and Tk.220/-. BLF teas sold quite\nwell between Tk.160 and Tk.234/-.\n\nDUST: 5,274 packages of tea on offer met with a good demand. Good\nliquoring Dusts sold well at around last levels. Their Mediums were also\nfully firm to slightly dearer closely following quality. Plain/BLF Dusts\nwere well competed for and prices appreciated on quality. Blenders lent\ngood support with fair interest from the Loose tea buyers.\n\nCOMMENTS: A stronger demand prevailed this week with the better\nsorts fetching good competition. Blenders lent useful support with more\ninterest from the Loose tea buyers.\n\nDusts sold well.\n\n(Courtesy - National Brokers Limited)\n\nMalawi Auction of 13th May 2025\n\nThere was less and selective interest for the 7740 packages on offer at\nfirm to easier rates.\nBP1 were up to 3USC easier where sold.\nPF1 met selective interest and were 15USC below valuation where sold.\nPD were neglected.\nD1 - Selected invoices fetched last levels. PF1SC held firm.\nSecondaries were all taken out with no bids\n\nKolkata Auction of 15th May 2025\n\nKOLKATA SALE CTC MARKET\n\nAssams tending easier following decline in quality and also seeing some\nwithdrawals. Medium and plainer Dooars selling around last levels.\n\n \n\nBUYING PATTERN:\n\nWestern India: Supporting the better teas\n\nHUL : Good support\n\nTCPL: Selective so far\n\nExporters : Fair enquiry\n\nOther Internal/Local: Operating\n\n \n\nKOLKATA SALE ORTHODOX MARKET\n\nMarket opened to strong demand. Well made Whole leaf and Larger\nBrokens selling at  firm rates. Well made Smaller Brokens and cleaner\nSecondaries irregular around last  levels. Remainder Whole leaf,\nBrokens and browner stalkier Secondaries showing a seasonal decline\nirregular and at times tending lower. Leafy Fannings selling readily.\n\n \n\nBUYING PATTERN:\n\nMiddle East : Active\n\nCIS:  Good Support\n\n \n\nKOLKATA SALE DUST MARKET\n\nMarket opened to good demand. Dust selling firm to occasionally\ndearer. PD grades barely steady noticing few outlots at times.\n\n \n\nBUYING PATTERN:\n\nHUL: Mainstay\n\nWestern India: Good Support\n\nLocal Internal: Operated\n\n \n\n(Courtesy - J Thomas & Company Private Limited)\n\nGuwahati Auction of 13th May 2025\n\nMarket: CTC\n\nThere was fair demand. Nominal quantity of improved varieties sold at\nfirm to occasionally dearer rates. Remainder were irregular and easier.\nBrowner sorts witnessed withdrawals.\n\nBuying Pattern: CTC.\n\nHUL, Western India, North India buyers lent fair support.. TCPL\nparticipated selectively. Exporters operated on the larger brokens.\n\n \n\nMarket: DUST\n\nThere was fair general demand. Select better liquoring sorts sold at firm\nto occasionally dearer. Remainder were irregular and easier following\nquality. Brown / plainer varieties witnessed withdrawals.\n\nBuying Pattern: DUST\n\nHUL participated actively on the better liquoring sorts. Western India,\nNorth India buyers operated.\n\n(Courtesy - Associated Brokers Pvt. Ltd – Guwahati)\n\nView more\nby scrolling down or swiping.\nHere's a tip: View more by scrolling down or swiping, or by using the arrow keys.",
    "embedded_bi_data": [],
    "bi_extraction_summary": {
        "total_bi_objects": 0,
        "successful_extractions": 0,
        "failed_extractions": 0
    }
}