[
  {
    "title": "Head of Tea Buying",
    "company": "The London Tea Company",
    "location": "London, England",
    "type": "Full-time",
    "link": "#",
    "snippet": "Seeking an experienced tea professional to lead our global sourcing and quality control team. Must have 10+ years of experience in the specialty tea industry...",
    "description": {
      "intro": "The London Tea Company is seeking an experienced and passionate Head of Tea Buying to lead our global sourcing and quality control team. This is a senior leadership role responsible for maintaining the exceptional quality of our existing tea portfolio while identifying new and exciting teas and botanicals from around the world.",
      "responsibilities": [ "Develop and execute the global sourcing strategy for all teas and herbal infusions.", "Manage relationships with tea gardens, estates, and suppliers worldwide.", "Lead the quality control and cupping team to ensure all products meet our high standards.", "Travel internationally to origin countries to meet with producers and inspect crops." ],
      "qualifications": [ "10+ years of experience in the specialty tea industry.", "Expert-level palate and tea tasting skills.", "Proven track record of international sourcing and supplier management." ]
    }
  },
  {
    "title": "Marketing Manager - Herbal Infusions",
    "company": "Pukka Herbs",
    "location": "Bristol, England",
    "type": "Full-time",
    "link": "#",
    "snippet": "Join our dynamic marketing team to drive growth for our herbal wellness tea category. Experience in FMCG marketing is essential...",
    "description": {
      "intro": "Join our dynamic marketing team to drive growth for our herbal wellness tea category. As the Marketing Manager, you will be responsible for developing and implementing marketing campaigns that resonate with our health-conscious consumers.",
      "responsibilities": [ "Create and manage multi-channel marketing campaigns.", "Analyze market trends and consumer insights.", "Collaborate with the product development team on new launches.", "Manage the brand's digital presence, including social media and email marketing." ],
      "qualifications": [ "5+ years of brand marketing experience, preferably in the FMCG sector.", "A passion for herbal wellness and sustainability.", "Strong digital marketing skills." ]
    }
  },
  {
    "title": "Tasting Room Associate (Part-Time)",
    "company": "Rare Tea Co.",
    "location": "Remote",
    "type": "Part-time",
    "link": "#",
    "snippet": "We are looking for an enthusiastic individual to assist in our tasting room, preparing samples and engaging with wholesale clients...",
    "description": {
      "intro": "We are looking for an enthusiastic and knowledgeable individual to assist in our tasting room. This role is crucial for providing an exceptional experience to our wholesale clients and visitors.",
      "responsibilities": [ "Prepare and serve tea samples with precision.", "Educate clients on the origin and unique qualities of our teas.", "Maintain the cleanliness and organization of the tasting room.", "Assist with inventory management and order processing." ],
      "qualifications": [ "A deep passion for and knowledge of specialty tea.", "Excellent communication and customer service skills.", "Ability to work flexible hours, including weekends." ]
    }
  }
]