{
    "report_title": "Market Report – 01st & 02nd September 2025",
    "source_url": "https://sway.cloud.microsoft/sDTTpiHAoKQJ2g3F?ref=Link",
    "retrieval_date": "2025-09-09T20:05:22.703721+00:00",
    "raw_text": "Accessibility View\nShare\nAnimations\nOn\n\nTMR.034\n\nThis week's Tea News\n\nTea prices rise in August but trail 2024 levels\n\nExperts Say This Little-Known Green Tea Is a Health Superstar (And It’s Not Matcha)\n\nTea Statistics\n\nClick the View button to load the embedded content\napp.powerbi.com\nView\nClick the View button to load the embedded content\napp.powerbi.com\nView\n\nMarket movement at International Auction Centers this week\n\nCurrency – As of 02nd September 2025\n\nElevation Average (August - 2025)\n\nHigh Grown\n\nRs. 1,106.20           USD 3.67\n\n\nMedium Grown\n\nRs. 1,029.10           USD 3.41\n\n\nLow Grown\n\nRs. 1,251.09           USD 4.15\n\n\nTotal\n\nRs. 1,182.27           USD 3.92\n\nQuantity Sold during the period 25th - 30th August 2025\n\nTea Tech Tips\n\nCheck infused tea leaves for unprocessed green leaf particles which\nindicates issues in the process from leaf quality, wither and faulty\nprocessing to machinery defects.\n\nCrop & Weather (For the period 27th August - 01st September 2025)\n\nThe Western and Nuwara Eliya planting districts experienced bright\nconditions followed by evening showers throughout the week. The\nDepartment of Meteorology forecasts scattered showers to be expected\nin both regions.\n\nUva/Udapussellawa's experienced sunny conditions. Rain be expected\nin both districts.\n\nThe Low growns reported bright conditions and occasional showers.\nShowers are to be expected in the Low grown districts.\n\nThe Western and Nuwara Eliya's maintained their crop intakes whilst\nthe Uva/Udapussellawa and Low grown districts reported a decline.\n\nWeather Forecast (For the period 04th  - 10th September 2025)\n\nHoliday Notice\n\nPlease note that our Head Office, Warehouse & Sample Room will be\nclosed for business on the  following day:\n\nFriday 05th September, 2025 - Milad-Un-Naby (Holy Prophet's\nBirthday)\n\nThis Week's Market Movement at Colombo Tea Auction\n\nOrder of Sale this week\n\nDemand: Ex-Estate met with good demand at mostly firm to dearer rates. Good demand\nprevailed for Low Growns.\n\nHigh Grown Teas\n\nBOP - Best Western's a few selected invoices appreciated by Rs.50/-\nper kg and more, whilst others were irregular. Teas in the Below Best\nmoved up by Rs.20-40/- per kg. Plainer sorts gained by Rs.50/- per kg\nand more. Nuwara Eliya's were mostly unsold. Uda Pussellawa's gained\nby Rs.20-40/- per kg. Uva's - There were no seasonal teas on offer,\nwhilst other non-seasonal types maintained.\n\nBOPF - Best Western's were firm to dearer by Rs.20-40/- per kg. Teas\nin the Below Best appreciated by Rs.50/- per kg and more. Plainer sorts\ngained by Rs.50/- per kg and more for the clean leaf teas. Nuwara\nEliya's were mostly unsold. Uda Pussellawa's were firm to dearer by\nRs.20-40/- per kg. Uva's - No seasonal teas on offer this week, whilst\nother non-seasonal types held firm.\n\nMedium Grown Teas\n\nBOP1 - Select best were firm whilst all others lost by Rs. 20/- per kg.\n\nOP1 - Select best maintained whilst all others were lower by Rs. 20/-\nper kg.\n\n\nPEK - Select best and best moved up by Rs. 50/- per kg. Below best\nwere dearer by Rs. 100/- per kg. Others gained by Rs. 50/- per kg.\n\nPEK1 - Select best held firm. Best and below best moved up by Rs.\n50/- per kg. Others remained unchanged.\n\nOP/OPA - Select best gained by Rs. 50/- per kg. Best held firm. Below\nbest appreciated by Rs. 40/- per kg. Others were lower by Rs. 50/- per\nkg\n\nFBOP- Select best appreciated by Rs. 20/- per kg. Best maintained\nwhilst all others moved up by Rs. 20/- per kg.\n\nFBOPF1 - Select best and best held firm. Best and below best were\ndearer by Rs. 20/- per kg.\n\nCTC Teas\n\nHIGH GROWN            \nBP1s - Hardly any offerings.\nPF1s - Mostly firm.   \n\nMEDIUM GROWN\nBP1s - Irregular.\nPF1s - Irregular.\n\nLOW GROWN\nBP1s - Best were sold well, whilst others were irregular.\nPF1s - Generally firm.\n\nLow Grown Teas\n\nBOP1 - Select best were firm whilst the best, below best and poorer\nsorts were irregular.\n\nOP1 - Select best were firm to lower, whilst others were firm.\n\nOP/OPA  - Select best and best were firm. Below best and poorer sorts\nwere irregular.\n\nPEKOE/PEKOE1 - Select best PEK's were firm, whilst best and below\nbest were firm to dearer. Select best and best PEK1's were firm to lower\nwhilst best and below best were firm to dearer.\n\nFBOP/FBOP1 - Select best and best were lower, whilst others were\nbarely steady.\n\nBOP - All round held firm.\n\nBOPF - All-round held firm.\n\nFBOPF/FBOPF1 - All around FBOPF’s were firm to lower. Select best\nand best FBOPF1's were barely steady, whilst others were marginally\nlower.\n\nOff Grades\n\nFGS/FGS1 - High growns were dearer by Rs. 40-60/- per kg. Medium\nand low growns eased by Rs. 10-20/- per kg. CTC's were lower by Rs.\n20-30/- per kg.\n\nBM - Cleaner varieties were firm. Below best and bottom eased by Rs.\n20-30/- per kg.\n\nBP -  Cleaner varieties maintained whilst the rest were irregularly lower\nby Rs. 20-30/- per kg.\n\nBOP1A - Select best were firm to dearer by Rs.50-70/- per kg. Below\nBest together with the poorer sorts were firm to lower by Rs.20/- per\nkg.\n\nDUST Grades\n\nDUST1 - Best and below best gained by Rs. 50-60/- per kg. CTC’s\nmaintained. Best and Below best low growns maintained.\n\n\nDUST - Cleaner secondaries appreciated by Rs.20 -40/- per kg. Low\ngrowns maintained.\n\nTop Prices  - Sale No.34 of 01st / 02nd September 2025\n\nFuture Sales Information (Sale No.35 of 09th & 10th September 2025)\n\n  Awaiting Sale – Catalogue Details\n\nSALE NO. 37 –  23RD & 24TH SEPTEMBER 2025\n\nEx-Estate catalogue and Main Sale catalogues are scheduled to be\nclosed on the 04th September 2025\n\n\nSALE NO. 38 –  29TH &  30TH SEPTEMBER 2025\n\nEx-Estate catalogue and Main Sale catalogues are scheduled to be\nclosed on the 11th September 2025\n\n\nSALE NO. 39 –  07TH &  08TH OCTOBER 2025\n\nEx-Estate catalogue and Main Sale catalogues are scheduled to be\nclosed on the 18th September 2025\n\nElevation Wise – Statistics – Colombo Auction Averages\n\nWorld Tea Production (In Million Kilos)\n\nSri Lanka Tea Sale Averages - Sub Elevation Wise – Month of August 2025\n\nSri Lanka Tea Sale Averages for the Month of August 2025 recorded Rs.\n1,182.27 (USD 3.92) vis-à-vis Rs. 1,188.49 (USD 3.95) (-Rs.6.22) in\n2024. High Growns for the month of August was Rs.1,106.20 as against\nRs.1,142.30 (-Rs.36.10) in 2024. Medium Growns recorded Rs.1,029.10\nvis-à-vis Rs.1,032.38 (-Rs.3.28) in 2024. Low Growns achieved Rs.\n1,251.09 vis-à-vis Rs.1,256.62 (-Rs.5.53) in 2024.\n\n \n\nThe cumulative figure for January to August stood at Rs.1,156.37 vis-à-\nvis Rs.1,249.99 in 2024. High Growns recorded Rs.1,074.61 as against\nRs.1,152.04 in 2024. Medium Growns were Rs.1,022.06 vis-à-vis\nRs.1.085.59 in 2024. Low Growns recorded Rs.1,228.04 vis-à-vis\nRs.1,337.77 in 2024. All three elevations recorded a drop in Rupee and\nDollar value when compared to the corresponding period in 2024.\n\n \n\nCTC Averages for the Month of August 2025 recorded Rs.986.45, with\nCTC High Growns at Rs.1,077.03, CTC Medium Growns at Rs.933.78,\nand CTC Low Growns at Rs.979.08. For the cumulative period of\nJanuary to August 2025, the total CTC average stood at Rs. 982.09, with\nCTC High Growns recording Rs.1,072.03, CTC Medium Growns at\nRs.937.85, and CTC Low Growns at Rs.978.73.\n\nOther Markets\n\nBangladesh Auction of 01st September 2025\n\nCTC LEAF: 53,109 packages of tea on offer met with a good demand.\n\nBROKENS: Well made good liquoring Brokens met with a strong\ndemand and were mostly slightly dearer following competition. Medium\nand Plain liquoring sorts met with quite a fair market and were about\nsteady. However, there were more withdrawals in the Plain category.\nBLF teas were in good demand at around last levels.\n\nFANNINGS: Good liquoring Fannings again met with a good demand\nand were firm to slightly dearer following competition. Medium varieties\nmet with a fair demand at around last levels whilst Plain types\nwitnessed a little less demand and with more withdrawals. BLF teas\nwere in good demand at around last levels.\n\nDUST: 13,303 packages of tea on offer met with a good demand. Good\nliquoring Dusts were in good demand and were generally slightly dearer.\nTheir Mediums met with fair interest and sold at around last levels\nclosely following quality but there were several withdrawals. Plain and\nBLF Dusts were in less demand and there were again more\nwithdrawals. Blenders lent strong support with fair interest from the\nLoose tea buyers.\n\nCOMMENTS: Blenders were the mainstay of the market operating for\nall varieties of offerings whilst Loose tea buyers remained quite\nselective.\n\nDusts were an easier market particularly the CDs.\n\n(Courtesy - National Brokers Limited)\n\nGuwahati Auction of 26th August 2025\n\nMarket: CTC\n\nThere was fair demand at steady to easier rates commensurate with\nquality and with significant withdrawals.\n\n \n\nBuying Pattern: CTC.\n\nThere was fair enquiry from HUL. TCPL, Western India, North India,\nother packeteers operated. Exporters were seen mostly on the larger\nbrokens.\n\n \n\nMarket: DUST\n\nThere was fair demand at steady to easier rates and with noticeable\nwithdrawals.\n\n \n\nBuying Pattern: DUST\n\nHUL lent fair support. TCPL, Western India, other packeteers operated.\n\n \n\n(Courtesy - Associated Brokers Pvt. Ltd)\n\nJakarta Auction of 29th August 2025\n\nDEMAND : Fair general demand continue to prevail.\n\nMARKET : Best teas prices witnessed irregularly steady prices in line\nwith quality. Fanning grade in this category fetched some gain following\ncompetition. Good teas once again sold selectively at steady prices with\nfew lots witnessing withdrawals. Steady demand was maintained on the\nremainders with select few invoices in the better medium types fetching\nfirm to dearer prices however, the others sold at irregularly steady levels\nas last.\n\n \n\nBUYING PATTERN : Major packers, exporters to Russia, Iraq, middle\neast and CIS continued to be active. Western India buyers were\nselective in line with quality. Regional & local buyers were selective as\nusual. Major blenders picked up 55.89% of the CTC Leaf sold.\n\n \n\nORTHODOX LEAF\n\nDEMAND :  Fair Demand.\n\nMARKET : High grown whole leaf & broken types irregular. Fanning\nwere irregular and easier. Others cleaner types tended dearer whilst\nremainders were at last levels and sometimes easier based on quality.\n\nBUYING PATTERN : CIS lent useful support on cleaner blacker\nvarieties along with Internal buyers. Shippers to middle east operated\non select whole leaf grades and broken. Internal continued to be\nchoosy.\n\n \n\nCTC DUST\n\nDEMAND : Good demand.\n\nMARKET: - CTC dust offer this week was at 370332.64Kgs of which\n320135.48kgs were sold (86.45%). Best & good category dust sold\nbarely steady to easier. Remainders sold fully firm to dearer following\nquality.\n\nBUYING PATTERN : Regional and local packers were selective on the\nbest & good teas. Middle east continued to be active on blacker sorts.\nOther up country buyers were continued to be selective.\n\n \n\nORTHODOX DUST\n\nDEMAND : Selective demand.\n\nMARKET : High grown primary dust sold steady. Clean, medium grown\nteas irregular. Secondaries were barely steady to easier.\n\nBUYING PATTERN : Regional & local packers were selective on\nprimary dusts. Exporters were very choosy at steady to easier prices on\nthe secondary dusts.\n\n \n\n(Courtesy - J Thomas & Company Private Limited)\n\nMombasa / Kolkata /Malawi Auction\n\nDue to the advancement of Tea Auctions in Colombo this week, reports\nof the above Auction Centers were not available at the time of printing\nthis publication.\n\nView more\nby scrolling down or swiping.\nHere's a tip: View more by scrolling down or swiping, or by using the arrow keys.",
    "embedded_bi_data": []
}